{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.21.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_3",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 768],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "dense_9_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [null, 768],
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_10",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_11",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "binary_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_10/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "dense_10/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_11/kernel", "shape": [64, 1], "dtype": "float32" },
        { "name": "dense_11/bias", "shape": [1], "dtype": "float32" },
        { "name": "dense_9/kernel", "shape": [768, 128], "dtype": "float32" },
        { "name": "dense_9/bias", "shape": [128], "dtype": "float32" }
      ]
    }
  ]
}
