{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.21.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 124, 129, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": "float32",
              "filters": 24,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 28,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "same",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [8, 256]
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "batch_input_shape": [null, null, 8, 256],
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 16,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                },
                "registered_name": null
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "binary_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [24],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [24],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [24],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [24],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [28],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [28],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [28],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [28],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/kernel",
          "shape": [256, 64],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/recurrent_kernel",
          "shape": [16, 64],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/kernel",
          "shape": [256, 64],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/recurrent_kernel",
          "shape": [16, 64],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/bias",
          "shape": [64],
          "dtype": "float32"
        },
        { "name": "conv2d/kernel", "shape": [3, 3, 1, 24], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [24], "dtype": "float32" },
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 24, 28],
          "dtype": "float32"
        },
        { "name": "conv2d_1/bias", "shape": [28], "dtype": "float32" },
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 28, 32],
          "dtype": "float32"
        },
        { "name": "conv2d_2/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [32, 64], "dtype": "float32" },
        { "name": "dense/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [64, 64], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [64, 1], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
